ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_romapi_e907.c
__ALWAYS_INLINE ATTR_TCM_SECTION
HBN_MCU_ROOT_CLK_Type HBN_Get_MCU_Root_CLK_Sel(void){
    return RomDriver_HBN_Get_MCU_Root_CLK_Sel();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
HBN_MCU_XCLK_Type HBN_Get_MCU_XCLK_Sel(void){
    return RomDriver_HBN_Get_MCU_XCLK_Sel();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint16_t HBN_Get_Ldo18flash_Repower_Config(void){
    return RomDriver_HBN_Get_Ldo18flash_Repower_Config();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint16_t HBN_Get_PIR_Interval(void){
    return RomDriver_HBN_Get_PIR_Interval();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint16_t HBN_Get_PIR_Threshold(void){
    return RomDriver_HBN_Get_PIR_Threshold();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t HBN_Get_Status_Flag(void){
    return RomDriver_HBN_Get_Status_Flag();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint32_t HBN_Get_Wakeup_Addr(void){
    return RomDriver_HBN_Get_Wakeup_Addr();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t HBN_Get_Core_Unhalt_Config(void){
    return RomDriver_HBN_Get_Core_Unhalt_Config();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t HBN_Get_Hand_Off_Config(void){
    return RomDriver_HBN_Get_Hand_Off_Config();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t HBN_Get_MM_Power_Config(void){
    return RomDriver_HBN_Get_MM_Power_Config();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
uint8_t HBN_Get_Pin_Wakeup_Mode(void){
    return RomDriver_HBN_Get_Pin_Wakeup_Mode();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void HBN_Enable(uint32_t aGPIOIeCfg, HBN_LDO_LEVEL_Type ldoLevel, HBN_LEVEL_Type hbnLevel, uint8_t dcdcPuSeq){
    return RomDriver_HBN_Enable(aGPIOIeCfg,ldoLevel,hbnLevel,dcdcPuSeq);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void HBN_Mode_Enter(HBN_APP_CFG_Type *cfg){
    return RomDriver_HBN_Mode_Enter(cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void HBN_Power_Down_Flash(SPI_Flash_Cfg_Type *flashCfg){
    return RomDriver_HBN_Power_Down_Flash(flashCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_All(void){
    return RomDriver_L1C_DCache_Clean_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Clean_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_Invalid_All(void){
    return RomDriver_L1C_DCache_Clean_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Clean_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Disable(void){
    return RomDriver_L1C_DCache_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Enable(uint8_t wayDsiable){
    return RomDriver_L1C_DCache_Enable(wayDsiable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Invalid_All(void){
    return RomDriver_L1C_DCache_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Disable(void){
    return RomDriver_L1C_ICache_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Enable(uint8_t wayDsiable){
    return RomDriver_L1C_ICache_Enable(wayDsiable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Invalid_All(void){
    return RomDriver_L1C_ICache_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_ICache_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_Set_Cache_Setting_By_ID(uint8_t core, L1C_CACHE_Cfg_Type *cacheSetting){
    return RomDriver_L1C_Set_Cache_Setting_By_ID(core,cacheSetting);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_Set_Wrap(uint8_t en){
    return RomDriver_L1C_Set_Wrap(en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void L1C_DCache_Write_Set(BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn){
    return RomDriver_L1C_DCache_Write_Set(wtEn,wbEn,waEn);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Default_Level_Config(defaultLvCfg,ram1Cfg,ram2Cfg,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Enable(cfg,cfg4,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3, PDS_CTL5_Type *cfg5){
    return RomDriver_PDS_Force_Config(cfg2,cfg3,cfg5);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntClear(void){
    return RomDriver_PDS_IntClear();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntMask(PDS_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_PDS_IntMask(intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Power_On_MM_System(void){
    return RomDriver_PDS_Power_On_MM_System();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_RAM_Config(PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg){
    return RomDriver_PDS_RAM_Config(ram1Cfg,ram2Cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Reset_LP_RTC(void){
    return RomDriver_PDS_Reset_LP_RTC();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_Flash_Pad_Pull_None(SF_Ctrl_Pin_Select pinCfg){
    return RomDriver_PDS_Set_Flash_Pad_Pull_None(pinCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_Flash_Pad_Pull_None_Fast(SF_Ctrl_Pin_Select pinCfg){
    return RomDriver_PDS_Set_Flash_Pad_Pull_None_Fast(pinCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntClr(PDS_GPIO_INT_SET_Type set){
    return RomDriver_PDS_Set_GPIO_Pad_IntClr(set);
}

